# 1."За допомогою функції print() виведіть на консоль: «Вивчайте Python!»"

# 2. "Призначте змінній age значення 20. Використовуючи змінну age та функцію print(), виведіть на консоль такий текст:\n" "Мені 20 років."

# 3. "Напишіть програму, яка обчислює площу кола з радіусом = 5. Використовуйте приблизне значення π=3.14.\n",
# "Роздрукуйте результат на консолі, як показано нижче.\n",
# "Площа: 78.5"

# 4. "Напишіть програму, яка обчислює майбутню вартість 1000 доларів США з річною процентною ставкою 3%, річною капіталізацією та 5-річним періодом інвестування. Округліть результат до найближчого цента.\n",
#                 "Майбутня вартість інвестиції: 1159,27 дол"

# 5. "З указаного імені файлу:\n",
# "filename = 'view.jpg'\n",
# "витягніть розширення та надрукуйте його на консолі."

# 6. "З наступного тексту:\n",
# "string = 'PKV-89415-PLN'\n",
# "дістати код, що містить перші три та останні три символи. Вивести результат на консоль."

# 7. "До поданого списку:\n",
# "cities = ['Київ', 'Харків', 'Одеса']\n",
# "додайте місто: 'Запоріжжя' і виведіть список на консоль."

# 8. "Подано такий словник:\n",
# "capitals = {\n",
# "     «США»: «Вашингтон»,\n",
# "     «Німеччина»: «Берлін»,\n",
# "     \"Австрія\": \"Відень\"\n",
# "}
# "Використовуйте відповідний метод, щоб отримати всі ключі зі словника столиць і надрукувати їх на консолі.\n",
# "Результат:\n","dict_keys(['США', 'Німеччина', 'Австрія'])"

# 9. "Подано такий словник:\n",
# "stocks = {\n",
# "     'MSFT.US': {'Microsoft Corp': 184},\n",
# "     'AAPL.US': {'Apple Inc': 310},\n",
# "     \"MMM.US\": {\"3M Co\": 148}\n",
# "}
# "Витягніть значення ключа «AAPL.US» і виведіть його на консоль."

# 10. "Надається така назва файлу:\n",
# "filename = '01012020_sales.xlsx'\n",
# "Перевірте, чи файл має розширення «xlsx». Вивести на консоль «ТАК», якщо істина, «НІ», якщо невірно."

# 11. "Надається такий пароль:\n",
# ""password = 'cskdnjcasa#!'\n",
# "Перевірте, чи містить пароль принаймні 11 символів і спеціальний символ «!».\n",
# "Якщо так, надрукуйте «Пароль правильний», інакше «Пароль неправильний»."


# 12. "Напишіть програму, яка знаходить усі двоцифрові числа, що діляться на 11 (використовуйте цикл for). Виведіть результат на консоль у вигляді значень, розділених комами, як показано нижче.\n",
# "11,22,33,44,55,66,77,88,99"


# 13. "Наведено наступний перелік номерів:\n",
# "elements = [1, 3, 4, 5, 6, 9, 10, 17, 23, 24]\n",
# "Напишіть програму, яка видаляє непарні числа та повертає ті, що залишилися. Вивести результат на консоль.\n",
# "[4, 6, 10, 24]"


# 14. "Наведено наступний перелік:\n",
# "symbols = ['k', 'b', 'c', 'j', 'z', 'w']\n",
# "Використовуючи вбудовані функції, поверніть першу та останню букви в алфавітному порядку зі списку та надрукуйте результат на консолі, як показано нижче.\n",
# "First: b\n",
# "Last: z"

# 15. "Реалізуйте функцію під назвою maximum(), яка повертає максимум із трьох чисел. Використовуйте умовний оператор."
